//// //2

// let text = "ԲԱԺԻՆ1 ԳԼՈՒԽ1 ՔՐԵԱԿԱՆ ՕՐԵՆՍԴՐՈՒԹՅԱՆ ԽՆԴԻՐՆԵՐԸ ԵՎ ՍԿԶԲՈՒՆՔՆԵՐԸ Հոդված1 Հայաստանի Հանրապետության քրեական օրենսդրությունը1. Հայաստանի Հանրապետության քրեական օրենսդրությունը բաղկացած է սույն օրենսգրքից: Քրեական պատասխանատվություն նախատեսող նոր օրենքներն ընդգրկվում են Հայաստանի Հանրապետության քրեական օրենսգրքում:2. Հայաստանի Հանրապետության քրեական օրենսգիրքը հիմնվում է Հայաստանի Հանրապետության Սահմանադրության և միջազգային իրավունքի սկզբունքների ու նորմերի վրա: Հոդված2 Հայաստանի Հանրապետության քրեական օրենսգրքի խնդիրները1. Հայաստանի Հանրապետության քրեական օրենսգրքի խնդիրներն են՝ հանցավոր ոտնձգություններից պաշտպանել մարդու և քաղաքացու իրավունքներն ու ազատությունները, իրավաբանական անձանց իրավունքները, սեփականությունը, շրջակա միջավայրը, հասարակական կարգը և անվտանգությունը, սահմանադրական կարգը, խաղաղությունը և մարդկության անվտանգությունը, ինչպես նաև կանխել հանցագործությունները:2. Այդ խնդիրների իրականացման համար Հայաստանի Հանրապետության քրեական օրենսգիրքն ամրագրում է քրեական պատասխանատվության հիմքն ու քրեական օրենսդրության սկզբունքները, որոշում, թե հանրության համար վտանգավոր որ արարքներն են համարվում հանցագործություններ, և սահմանում է պատժի տեսակներ ու քրեաիրավական ներգործության այլ միջոցներ՝ դրանք կատարելու համար: ԳԼՈՒԽ2 ՔՐԵԱԿԱՆ ՕՐԵՆՔԻ ԳՈՐԾՈՂՈՒԹՅՈՒՆԸ ԺԱՄԱՆԱԿԻ ԸՆԹԱՑՔՈՒՄ ԵՎ ՏԱՐԱԾՈՒԹՅԱՆ ՄԵՋ Հոդված1 .Քրեական օրենքի գործողությունը ժամանակի ընթացքում1. Արարքի հանցավորությունը և պատժելիությունը որոշվում են դա կատարելու ժամանակ գործող քրեական օրենքով:2. Հանցանքը կատարելու ժամանակ է համարվում հանրության համար վտանգավոր գործողությունը (անգործությունը) իրականացնելու ժամանակը՝ անկախ հետևանքները վրա հասնելու պահից: Հոդված2 .Քրեական օրենքի հետադարձ ուժը1. Արարքի հանցավորությունը վերացնող, պատիժը մեղմացնող կամ հանցանք կատարած անձի վիճակն այլ կերպ բարելավող օրենքը հետադարձ ուժ ունի, այսինքն՝ տարածվում է մինչև այդ օրենքն ուժի մեջ մտնելը համապատասխան արարք կատարած անձանց, այդ թվում՝ այն անձանց վրա, ովքեր կրում են պատիժը կամ կրել են դա, սակայն ունեն դատվածություն:2. Արարքի հանցավորությունը սահմանող, պատիժը խստացնող կամ հանցանք կատարած անձի վիճակն այլ կերպ վատթարացնող օրենքը հետադարձ ուժ չունի:3. Պատասխանատվությունը մասնակիորեն մեղմացնող և միաժամանակ պատասխանատվությունը մասնակիորեն խստացնող օրենքը հետադարձ ուժ ունի միայն այն մասով, որը մեղմացնում է պատասխանատվությունը:"

// let splittext = text.split(" ");   // ["", "", "", "", "", ""]

// const b1 = "ԲԱԺԻՆ1";
// const g1 = "ԳԼՈՒԽ1";
// const h1 = "Հոդված1";
// const h2 = "Հոդված2";
// const g2 = "ԳԼՈՒԽ2";

// function fun(a, b) {
//   return a.findIndex(function(val) {
//     return val === b
//   });
// }

// function removeAtIndex(arr, index) {
//     return arr.filter(function(val, i) {
//          return i !== index;
//     });
// };                   


// let splittexth1 =  removeAtIndex(splittext, fun(splittext, h1)) // veradardsnuma arajin h1-y hanacs zangvacs
// let splittexth2 =  removeAtIndex(splittext, fun(splittext, h2)) // veradardsnuma arajin h2-y hanacs zangvacs

// const strb1 = removeAtIndex(splittext, fun(splittext, b1)).join(" "); // b1-i texty 

// function re(arr, index, ind) {
//   return arr.filter(function(val, i) {
//        return  (ind > i) && (i > index) ;
//   });
// };    

// const strg1 = re(splittext, fun(splittext, g1), fun(splittext, g2)).join(" ");  // g1-i texty
// const strg1h1 = re(splittext, fun(splittext, h1), fun(splittext, h2)).join(" "); // g1-i  h1-i texty
// const strg1h2 = re(splittext, fun(splittext, h2), fun(splittext, g2)).join(" "); // g1-i h2-i texty
// const strg2 = re(splittext, fun(splittext, g2), splittext.length).join(" "); // g2-i texty
// const strg2h1 = re(splittext, fun(splittexth1, h1)+1, fun(splittexth2, h2)+1).join(" "); // g2-i h1-i texty
// const strg2h2 = re(splittext, fun(splittexth2, h2)+1, splittext.length).join(" "); // g2-i h2-i texty


// let arr3 = ["Հոդված1", "Հոդված2"]
// let arr4 = [ strg1h1, strg1h2]

// let arr5 = ["Հոդված1", "Հոդված2"]
// let arr6 = [ strg2h1, strg2h2]

// const obj2 = arr3.reduce(function(aggr, val) {
//   arr4.forEach(function(value) {
//      aggr[val] = value
//   })
//   return aggr
// }, {})

// const obj3 = arr5.reduce(function(aggr, val) {
//   arr6.forEach(function(value) {
//      aggr[val] = value
//   })
//   return aggr
// }, {});


// const object = {"ԲԱԺԻՆ1":{"ԳԼՈՒԽ1":obj2, "ԳԼՈՒԽ2":obj3,}}

// alert(JSON.stringify(object), undefined, 4);

// // // {
// // //     bajin1:{
// // //         glux1:{
// // //             hodvacs1:{
// // //             },
// // //             hodvacs2: {
// // //             }
// // //         },
// // //         glux2:{
// // //             hodvacs1: {
// // //             },
// // //             hodvacs2: {
// // //             }
// // //         }
// // //     }
// // // }