// // 1
// // եթե համեմատությունը վերադարձնում է true ապա առաջի տրված արժեքն է վերադարձնում իսկ եթե համեմատությունը վերադարձնում է false երկրորդ արժեքնա վերադարձնում այսինքն եթե առաջի արժեքը չի վերադարձնում հակառակ դեպքում երկրորդ արժեքնա վերդարձնում ինչպես որ if else-ի դեպքում է եթե առաջի if բլոկը չի աշխատում հակառակ դեպքում երկրորդ else բլոկնա աշխատում
// const age = 54;

// // let message;
// // if(age >= 10) {
// //     message = "yes";
// // } else {
// //     message = "no";
// // }


// let message = age >= 10 ? "yes" : "no";

// alert(message); // yes


// // 2
// // երբ արժի ternary operator օգտագործել
// // ուշադրություն դարձրեք այս դեպքում եթե ընդամենը կա մի հատ if և else և եթե մի տող կա ամեն մեկի մեջ ինչպես տեսնում եք և հիմնականում երբ որ մենք վերագրում ենք հաճախ էտ ժամանակ է օգտագործվում
// // այսինքն ստեղ վերգրում ենք "yes"-ը message-ին ստեղ վերագրում ենք "no"-ն message-ին



// // 3
// // եվս մեկ օրինակ
// // const a = [5, 22, 99, 44, 55].map((val) => {
// //     if(val % 2 === 0) {
// //         return "even";
// //     }
// //     return "odd";
// // });
// // alert(a);  // odd, even, odd, even, odd


// const b = [5, 22, 99, 44, 55].map((val) => {
//     return val % 2 ? "even" : "odd";
// });
// alert(b);  // odd, even, odd, even, odd


// const c = [5, 22, 99, 44, 55].map((val) => val % 2 ? "even" : "odd");
// alert(c);  // odd, even, odd, even, odd


// // 4
// // հնարաոր է ternary operator-ի մեջ օգտագործել ternary operator ասենք ասել եթե դա true է վերադարձրա էս արժեքը եթե դա false է հիմա էս երկրորդ համեմատությունը ստուգի եթե սա էլ է true վերադարձրա էս հակառակ դեպքում էս, else if-ի պես հակառակ դեպքում եթե 
// // բայց չարժի նման բան անել քանի որ մեր ամբողջ նպատակը նա է որ մենք այնպիսի կոդ գրենք որպեսզի հեշտ կարդացվի հեևաբար եթե ternary operator-ը ձեզ օգնումա որ ձեր կոդը լինի կոկիկ և պարզ օգտագործեք իսկ եթե հասկանում եք որ ternary operator օգտագործելուց ձեր կոդը ավելի դժվար է հասկանալ և ավելի դժվար է կարդալ ավելի լավ է սովորական if else-երով գրել

// const age = 10;

// // let message;
// // if(age > 10) {
// //     message = "yes";
// // } else if(age === 10) {
// //     message = "hello"
// // } else {
// //     message = "no";
// // }

// let message = age < 10 ? "yes":  age === 10 ? "hello" : "no";

// alert(message); // hello



