// 2
// 3
// const label = document.querySelector("#label");
// label.innerHTML = "hi";

// 5
// 1.
// const text = document.querySelector("#text");
// text.addEventListener("keydown", function() {  
//     alert("hi");
// });
// 2.
// const text = document.querySelector("#text");
// text.addEventListener("keyup", function() {  
//     alert("hi");
// });

// 6.
// const text = document.querySelector("#text")
// text.addEventListener("keydown", function() {
//     alert(text.value)
// });

// 7.
// const text = document.querySelector("#text")
// text.addEventListener("keydown", function(evt) {
//     alert(evt.target.value)
// })

// 8.
// const labell = document.querySelector("#labell")
// const texst = document.querySelector("#texst")
// texst.addEventListener("keyup", function(evt) {
//     labell.innerHTML = evt.target.value;
// })

// 9.
// 1.
// const box = document.querySelector("#box");
// box.addEventListener("mouseenter", function() {
//     box.style.backgroundColor = "green"
// })
// 2.
// box.addEventListener("mouseleave", function(evt) {
//     box.style.backgroundColor = "red"
// })


// .
// html-ը ասում է ինչա պետք նկարել 
// css-ը ասում է ինչպեսա պետք նկարել և ինչպեսա դա անում ինքը ունի օրենքներ օրինակ սա որը ասում է գտիր բոլոր էլեմենտները html-ի մեջ որոնք որ համընկվում են էս օրենքին այսինքն օրինակ էս պարագայում բոլոր էն էլեմենտները ում id-ին label է ու իրենց դարձրու կարմիր, տեքստը դարձրու կարմիր
// և կա իհարկե javascript որտեղ որ մենք կարող ենք գրենք մեր լոգիկան

// 1.
// և մինչ այսօր մենք սովորել ենք որ կան if էր loop էր և այլն այսինքն լոգիկա մենք կարող ենք արտահայտենք բայց ինչպես կարող ենք մենք շփվենք html-ի հետ մեզ պետքա ինչ որ մեխանիզմ ինչ որ ֆունկցիաներ ինչ որ ատրիբուտներ ինչ որ փոփոխականներ որպեսզի մենք կարողանանք խոսանք html-ի հետ ինչպես 
// բրաուզերը մեզ տալիսա մի հատ փոփոխական որը կոչվումա document էտ փոփոխականի մեջ կա object էտ object-ը ունի ամեն ինչ ինչ որ մեզ պետքա որպեսզի մենք խոսանք html-ի հետ ինքը իր մեջ պահում է ամբողջ ստրուկտուրան object-ներով javascript-ի object-ներով արտահայտված զանգվածներով և այլն, որը իր մեջ ունի ամեն ինչ որը նկարագրում է ինչ է կատարվում html-ում
// և մենք ուրեմն էտ ստրուկտուրայի էտ object-ների հետ կարող ենք շփվենք կարող ենք իրենցից կարդանք և նույնիսկ կարող ենք իրենց փոխենք և երբ որ մենք փոխում ենք էտ object-ները բրաուզերը նորից նկարումա էտ մասը որպեսզի ոնցոր թարմացնի էկրանը էտ մեր փոփոխություններով


// 2.
// եկեք տեսնենք մի օրինակ
// ստեղ մենք կարող ենք անենք document ու ինքը բացի նրանից որ ունի ամբողջ ստրուկտուրա իր մեջ ինքը նաև ունի ֆունկցիաներ որպեսզի մենք հատ հատ չքայլենք էտ ստրուկտուրայով ու գտնենք էտ էլեմենտը մենք կարող ենք մի հատ ֆունկցիա կանչենք որը կոչվում է querySelector որին մենք փոխանցում ենք մի հատ տեքստ որը css-ի selector-ների պեսա այսինքն օրենք ենք մի հատ տալիս իրեն և ինքը գտնումա էն էլեմենտը որը բռնումա էտ օրենքին այսինքն ստեղ եթե մենք այս օրենքը փոխանցենք իրեն #label էս օրենքը ինչա նշանակում նշանակումա են էլեմենտը ում id-ին label-ա չէ, ինքը գնումա գտնումա իր մեջ էտ ստրուկտուրայի մեջ էտ object-ների մեջ էն object-ը ում id-ին label է և վերադարձնում է
// document.querySelector("#label");
// եկեք դա ուրեմն վերագրենք ինչ որ փոփոխականի մեջ label ինչու չէ
// const label = document.querySelector("#label");
// alert(label);
// կտպի [object HTMLDivElement]
// այսինքն մի հատ object կա որը նկարագրում է այս div-ին

// 3.
// հիմա եկեք div-ի այս էլեմենտի ներքին html-ը այս ներքին մասը փոխենք ինչպես դա կարող ենք անենք label.innerHTML կարող ենք վերագրենք ինչ որ ուրիշ բանի օրինակ "hi"
const label = document.querySelector("#label");
label.innerHTML = "hi"
// ինչ է կատարվում ստեղ ուրեմն ամենասկզբից բրաուզերը կարդում է html-ը և նկարում է hello world էկրանի վրա որը կարմիր է էս օրենքի պատճառով բայց հետո javascript-ը երբ որ աշխատացնում է javascript-ում մենք գնում ենք գտնում ենք են object-ը document-ի տակ որը նկարագրում է label-ին և իր innerHTML-ը փոխում ենք հետևաբար բրաուզերը ռակցիայա տալիս մեր փոփոխությունին և ջնջումա hello world-ը և իրա տեղը գրում է hi 

// 4. DOM(document object model) 
// էտ object-ները էս ամբողջ ստրուկտուրան էս document-ի և object-ների որ նկարագրում են html դրան մենք կոչում ենք dom(document object model(Փաստաթղթի օբյեկտի մոդել)) այսինքն ինքը object-ներ են որոնք որ նկարագրում են html-ը ում հետ կարելիա շփվել որպեսզի html-ը օրինակ փոխենք օրինակ innerHTML-ով կարող ենք փոխենք 
// DOM-ում բոլոր HTML տարրերը սահմանվում են որպես օբյեկտներ:

// // HTML DOM-ի միջոցով JavaScript-ը կարող է մուտք գործել և փոխել HTML փաստաթղթի բոլոր տարրերը:
// // HTML DOM-ը ստանդարտ օբյեկտի մոդել է և ծրագրավորման ինտերֆեյս HTML-ի համար: Այն սահմանում է.
// // HTML տարրերը որպես օբյեկտներ
// // Բոլոր HTML տարրերի հատկությունները
// // HTML-ի բոլոր տարրերին մուտք գործելու մեթոդներ
// // Իրադարձություններ բոլոր HTML տարրերի համար
// // Այլ կերպ ասած՝ HTML DOM-ը ստանդարտ է՝ ինչպես ստանալ, փոխել, ավելացնել կամ ջնջել HTML տարրեր:


// 5.
// բացի նրանից որ մենք կարող ենք փոխենք html-ը մենք նաև կարող ենք ուշադրություն դարձնենք թե ինչ է կատարվում մեր էջի հետ ասենք user-ը օգտագործողը ինչ է անում մուկն է շարժում ինչ որ տեքստ է փոխում որպես օրինակ եկեք ստեղծենք մի հատ էլեմենտ  <input type="text">   որպեսզի ստանանք տեքստ user-ից 
// բայց ինչպես նախ պետքա կարդանք էտ ինֆորմացիան էտ user-ը ինչ է գրել ստեղ 1 երկրորդը մենք պետքա իմանանք երբ էտ ինֆորմացիան փոխվումա էս ընթացքում երբ որ ես տպում եմ ես ուզում եմ իմանամ դրա մասին ինչպես կարող եմ դա անեմ

// 1.
// նախ և առաջ եկեք select անենք են object-ը որը նկարագրում է էս input-ը  
// document.querySelector("#text")
// դե եկեք դա դնենք ինչ որ մի փոփոխականի մեջ
// const text = document.querySelector("#text")

// 2.
// հիմա նայեք ինչ կարող ենք անենք
// text.addEventListener()
// addEventListener-ը ինչ է դա ֆունկցիա է որը կցած է էտ object-ին հա էտ dom-ի էլեմենտի object-ին որը հնարաորություն է տալիս որ մենք լսենք ինչ որ փոփոխություների, ինչ փոփոխություների պետք է ասենք առաջին պարամետրը հենց դա թե մենք ինչին ենք լսում ինչա մեզ հետաքրքրում էս պարագայում մեզ հետաքրքրումա են ժամանակ երբ որ user-ը տպումա ինչ որ բան չէ իսկ տպելը ինչա նշանակում նշանակումա կոճակը սխմում ենք թողում ենք սխմում ենք թողում ենք չէ դայա տպելը

// 1 //
// այսինքն կոճակը որը key է մենք ուզում ենք իմանանք երբ նա սխմվում է keydown երբ որ էտ կոճակը բրդում ենք ներքև keydown էտ ժամանակ ես փոխանցումեմ մի հատ ֆունկցիա որը կկանչվի էտ ժամանակ
// եկեք նայեք ստեղ եկեք ստեղ alert անենք hi
const text = document.querySelector("#text")
text.addEventListener("keydown", function() {
    alert("hi")
});
// հիմա ինչ է ստացվում որ ամեն անգամ մենք սխմենք ինչ որ կոճակ ստեղ մենք կտեսնենք alert որը կասի hi նայեք սխմեցի տեսանք hi
// հիմա եթե նկատում եք ես հիմա key եմ սխմելու սխմեցի տեսեք դեռ ստեղ չի նկարվել էս alert-ը գնումա նորա նկարվում ինչու որովհետև keydown-ը սկզբից կանչում է մեր ֆունկցիային հետո նոր բրաուզերը նկարումա

// 2 //
// հետո մի հատել event կա որը կոչվումա keyup երբ որ կոճակը նորից բարձրանումա վերև եկեք keydown-ի տեղը ուշադրություն դարձնենք keyup-ին այսինքն են ժամանակ երբ որ մենք կոճակը թողենք   
const textt = document.querySelector("#textt")
textt.addEventListener("keyup", function() {
    alert("hi")
})

// // // keydown-ի ժամանակ պատուհանը բացումա ոնց էտ պահին կա input-ի մեջ հետո նոր տպվումա input-ի մեջ մեր գրածը
// // // keyup-ի ժամանակ տպվումա input-ի մեջ մեր գրածը հետո նոր keydown-ի ժամանակ պատուհանը բացումա ոնց էտ պահին կա input-ի մեջ 

// այսիքն այսպես մենք կարողանում ենք էլէմենտներից ինֆորմացիա ստանալ երբ որ ինչ որ մի բան փոխվումա 


// 6.
// հիմա եկեք ոչ թե alert անենք hi այլ հենց էտ էլեմենտի արժեքը որովհետև դայա վերջում հետքրքիր չէ թե ինչ են գրել էտ տուփի մեջ ինչպես դա կարելիյա ստանալ դե text-ը էտ object-նա էտ input-ի object-նա իրա արժեքնա մեզ պետք  արժեք value  text.value օկեյ
const texttt = document.querySelector("#texttt")
texttt.addEventListener("keydown", function() {
    alert(texttt.value)
})
// keydown-ը աշխատումա են ժամանակ երբ որ մենք կոճակը սխմում ենք և սկզբից կանչումա մեր ֆունկցիաին հետո նոր բրաուզերը նկարումա
// keyup-ը աշխատումա են ժամանակ երբ որ մենք կոճակը թողում ենք և սկզբից բրաուզերը նկարումա հետո նոր կանչումա մեր ֆունկցիան




// 7.
// նենցա ստացվում որ էս addEventListener-ի function-ը երբ որ կանչվումա փոխանցվումա մի հատ object որը կկոչենք evt(event) էտ evt-ը ունի իրա վրա կպած մի հատ ատրիբուտ որը կոչվում է target, target-ը հղվածա դեպի են object-ը dom-ի, object-ը որը մեզ կանչելա այսնինք էս պարագայում դա նույն է ինչպես որ text այսինք սա evt.target իրականում նույն է ինչպես որ text որը նշանակում է մենք ստեղ կարող ենք անենք alert(evt.target.value)

const textttt = document.querySelector("#textttt")
textttt.addEventListener("keydown", function(evt) {
    alert(evt.target.value)
})

// // // այսինքն evt.target === textttt  էս պարագայում

// հիմա եթե ստեղ սխմեմ 8 կտեսնեմ ութ եթե սխմեմ ինը կտեսնեմ ութսունինը և այլն և այլն, որպես տեքստ սա որպես թիվ չի այլ որպես տեքստ նույն ձևի ոնցոր prompt որ անում եինք ստանում էինք տեքստ նույն ձևի ստեղ 




// 8.
// հիմա եկեք label-ի innerHTML-ը վերագրենք դեպի էտ արժեքը հիմա ինչ է ստացվում, ստացվում է որ ստեղ եթե մենք սկսենք տպել ինչպես տեսնում եք մի տեղից ոնցոր արժեքը մենք կարդում ենք, ամեն անգամ կոճակը թողվումա մենք կարդում ենք ինֆորմացիան և copy ենք անում դա էս տակի div-ի innerHTMl-ի մեջ հետևաբար սենց մի հատ սենց իրավիճակա ստեղծվում որ մի տեղից կարդում ենք երբ որ փոխվումա և երբ որ փոխվումա գրում ենք դեպի div-ի innerHTML-ը

//  ????  //
/* const labell = doncument.querySelector("#labell")
const texT = document.querySelector("#texT")
texT.addEventListener("keyup", function(evt) {
    alert(evt.target.value);
})
//  ????  // */

const labell = document.querySelector("#labell")
const texst = document.querySelector("#texst")
texst.addEventListener("keyup", function(evt) {
    labell.innerHTML = evt.target.value;
})

//  և այսպես հետաքրքիր ոնցոր մի հատ էլեմենտար բան է ստացվում 





// 9.
// բացի կոճակի event-ներից այսինքն երբ որ կոճակը սխմվումա կամ երբ որ թողում ենք էտ կոճակը և այլն, մենք նաև կարող ենք ուշադրություն դարձնենք ուրիշ event-ների օրինակ մուկի շարժումի
// օրինակ 
// const box = document.querySelector("#box")
// box.addEventListener()

// 1.
// և եկեք լսենք են ժամանակ երբ որ մուկը մտնի իրա մեջ այսինքն մտնի իր սահմանի ներս դա ինչպես ենք անում mouseenter երբ որ մուկը մտնի էտ ժամանակ կկանչվի մեր ֆունկցիան
// և ինչ որ ռակցիա կարող ենք տանք,
// ինչ ռակցիա տանք եկեք գույնը փոխենք կարմիրա եկեք դարձնենք կանաչ ինչու չէ նենց որ եկեք անենք box.style դա իր css-ի style-նա ու ստեղ ․backgroundColor թող լինի green

const box = document.querySelector("#box");
box.addEventListener("mouseenter", function() {
    box.style.backgroundColor = "green"
})

// 2.
// հիմա ստեղ մի հատ ուշադրություն դարձրեք ստեղ ոնցոր camelcase ենք գրել, ուղտային տեքստա  այսինքն կպածա իրար C մեծատառ իսկ ստեղ(css-ում) մինուսովա - գրված ինչա ստեղ սենց ստեղ սենց որովհետև հիշեք որ javascript-ում եթե մենք սենց անենք background-color սա javascript-ում նշանակումա մինուս այսինքն մենք սրանից հանում ենք սա բայց դա չենք ուզում անենք մենք նկատի ունենք backgroundcolor  որպես մի անուն հետևաբար մենք սենց կպածենք իրեն գրում backgroundColor այսպես 
// հիմա նայեք հենց մուկը մտնի իր սահմանի մեջ կդառնա կանաչ

// 3.
// հիմա մենք նույնպես կարող ենք մի հատ էլ event ավելացնել երբ որ մուկը դուրս գա mouseleave երբ որ մուկը դուրս գա և եկեք հետ դարձնենք կարմիր
box.addEventListener("mouseleave", function(evt) {
    box.style.backgroundColor = "red"
})


// 10.
//  և այսպես շատ հեշտ մենք կարողանում ենք ոնցոր ուշադրություն դարձնել երբ որ ինչ որ մի բան կատարվում է html-ի մեջ, ռեակցիա տանք և հետ փոխենք ինչ որ մի բան dom-ի մեջ որպեսզի html-ը ոնցոր ստանա էտ մեր փոփոխությունը, բրաուզերը արդեն ավտոմատ դա կանի կջնջի հինը կնկարի նորը


