// // 1
// // որպեսզի մենք ասենք բրաուզերին որ այս index.js-ը սովորական javascript ֆայլ չէ այլ modul(մոդուլ) է մենք պետք է անենք այդպես 

// <script type="module" src="index.js"></script>


// // 2
// // ինչով է տարբերվում module-ը սովորական javascript ֆայլից դե մի քանի պատճառով բայց ամենապարզ ամենավառ օրինակը նա է որ երբ որ որևէ javascript-ը modul է ինքը աշխատում է strick mode-ում 
// // եթե հիշում եք երբ որ սովորական javascript էինք գրում մենք կարող էինք որոշեինք կամ գրեինք "use strick" տեքստը դնեինք վերևը որը նշանակումա տեքստը կաշխատի strick mode-ի մեջ կամ եթե չէինք դնում չէր աշխատում strick mode-ի մեջ
// // բայց modul-ները միշտ strick mode-ում են աշխատում, դա նշանակում է մեր կոդը աշխատում է մի քիչ ուրիշ ձևով հետևաբար մենք պետք է ասենք բրաուզերին որ էս ֆայլը modul է և օգտագործելու է ուրիշ modul-ներին ուրիշ ֆայլերին 


// // 3
// // 3.1
// // ինչպես կարելի է ստեղծել մի հատ ուրիշ ֆայլ և իրեն, իր մեջի ինֆորմացիան օգտագործել ստեղ 


// // ինչպես կարող ենք անենք որ hello.js ֆայլի մեջի ֆունկցիան հասանելի լինի էտ ֆայլից դուս որպեսզի նա հասանելի լինի մենք պետք է իրեն export անենք 
// // ոնց ենք անում դա գրում ենք ֆունկցիայից առաջ export

// export function sayHi() {
//     console.log("hello Armenia");
// };


// // 3.2
// // index.js-ում որպեսզի օգտագործենք մենք այս ֆունկցիան մենք անում ենք հետևյալը 
// // անում ենք import(ներմուծել) այսինքն քաշում ենք բացում ենք էն խուճուճ փակագծերը {} և իր մեջ գրում ենք անունը էն բանի որը մենք ուզում ենք քաշենք դե էս պահին մենք ուզում ենք sayHi ֆունկցիան չէ նենց որ գրում ենք sayHi, հետո գրում ենք from(որտեղից) և չակերտների մեջ գրում ենք ճանապարհը դեպի են ֆայլը որի մեջ sayHi-ը գտնվում է, և էտ ֆայլը քաշում ենք և էտ ֆայլի մեջից քաշում ենք sayHi ֆունկցիան և հիմա մենք էտ sayHi ֆունկցիան կարող ենք օգտագործենք օրինակ իրեն կարող ենք կանչենք 

// import {sayHi} from "./hello.js";

// sayHi();


// // 4
// // 4.1
// // էլի եմ նշում 
// // ունենք index.html որին մենք  ունենք script teg որը հղում է դեպի մեր index.js ֆայլը մենք բրաուզերին ասում ենք բրաուզեր ջան սա սովորական ֆայլ չէ սա module է, նենց որ հարգի էտ փաստը աշխատացրա իրեն strick mode-ում և եթե ինքը որևէ բան import անի խնդրում եմ գնա և էտ ֆայլն է քաշի որպեսզի նա կարողանա իր մեջի ինֆորմացիան օգտագործի 
// // դա էս է <script type="module" src="index.js"></script>

// // 4.2
// // հետո
// // մենք մտնում ենք index.js-ի մեջ որը ասում է import ասում է մենք ուզում ենք էս մասնիկը էս ֆայլի մեջի, այսինքն բրաուզերը երբ որ էս javascript-ը կարդում է ասում է օկեյ ես էս ֆայլը պետքա նախ և առաջ քաշեմ քաշում է և հետո իր մեջից քաշում են դուրս sayHi ֆունկցիան որին մենք հիմա կարող ենք օգտագործենք 
// import {sayHi} from "./hello.js";

// sayHi();

// // 4.3
// export function sayHi() {
//     console.log("hello Armenia");
// };


// // 5
// // հիմա բացի ֆունկցիայից մենք կարող ենք ցանկացած ուրիշ բան export անենք 
// // օրինակ կարող ենք մի հատ const-ը export անենք․

// import {sayHi, PI, Dog} from "./hello.js";

// sayHi();
// console.log(PI);

// const d = new Dog();
// d.woof();



// // 6.
// // կարող է փոփոխական լինի որ չօգտագործենք


// // 7.
// // տարբերակները
// // 1.
// // 2.


// // 3.
// // մենք կարող ենք անենք import հետո ստեղ դնենք որևէ անուն կապ չունի եկեք գրենք hopar
// // import hopar from "./hello.js";

// // էս հոպարի արժեքը ինչ է
// // հոպարը կընդունի են արժեքը որը export է արած այ էս ֆայլից(էս դեպքում hello.js ֆայլից) որպես default
// // այսինքն էս պարագայում այ էս ֆունկցիան(foo ֆունկցիան) կգնա և կմտնի hopar-ի մեջ
// // և հիմա մենք կարող ենք հիմա կանչենք hopar-ին որը իհարկե ընդունել է էտ ֆունկցիայի արժեքը և ահա ստանում ենք foo 

// import hopar from "./hello.js";

// hopar();  // foooo


// // 8
// // հիմա մենք նաև կարող ենք 
// // հիմա էս ել ենք export արել default-նել ենք export արել չէ
// // իչպես կարող ենք ստանանք և default-ը և էս մնացածը

// import hopar, {sayHi} from "./hello.js"

// hopar();   // hello Armenia
// sayHi();   // foooo



// // 9
// ամփոփում



// // 10
// import hopar, {sayHi as poghos} from "./hello.js";

// // function sayHi() {
// //     console.log("hello World");
// // }

// hopar();
// poghos();
// sayHi()



// // 11
// // module-ները կպցնել իրար
// // amboxj-ը կպցնել իրար որ դառնա մի հատ ֆայլ






// // // export(արտահանում) import(ներմուծում)









