/*
Math
   round
   floor
   ceil

   min
   max

   pow

   random  // 0 - 1
*/

// // Math object-ին կցած են որոշ ֆունկցիաներ որոնք որ հնարաորություն են տալիս որոշ մաթեմաթիկական գործողություններ անել



// // 1. round ֆունկցիային տալիս ենք թիվ և նա այդ թիվը կլորացնում 

// alert(Math.round(3.5));

// // կտպի 4



// // 2. floor(հատակ) ֆունկցիան թիվը կլորացնում է դեպի ներքև

// alert(Math.floor(3.9));

// // կտպի 3



// // 3. ceil(առաստաղ) ֆունկցիան թիվը կլորացնում է դեպի վերև

// alert(Math.ceil(3.1))

// // կտպի 4


// // 4. min ֆունկցիաին տալիս ենք թվեր և նա վերադարձնում է ամենափոքր թիվը

// alert(Math.min(5, 47, 18, 3));

// // կտպի 3

// // 5. max ֆունկցիաին տալիս ենք թվեր և նա վերադարձնում է ամենամեծ թիվը

// alert(Math.max(3, 10, 20, 5));

// // կտպի 20


// // 6. pow ֆունկցիային տալիսենք երկու թիվ և նա վերադարձնում է առաջի թվին բարձրացրած երկրորդ թվի աստիճանը

// alert(Math.pow(2, 3));

// // կտպի 8



// // 7. random(պատահական) ֆունկցիան վերադարձնում է որևէ թիվ 0-ից մինչև 1-ը ընկած սահմանում

// alert(Math.random());

// // կտպի 0 կամ 0,․․


/// եթե մենք ուզում ենք ստանանք 1-ից մինչև 10

// alert(Math.floor(Math.random() * 10) + 1);
// for(let i = 0; i < 10; i++ ) {
//     alert(Math.floor(Math.random() * 10) + 1);
// }