let x = [5, 56, 4, 2, 7, 579, 6];
let y = [];

let i = 0;
let i2 = 0;
while(i < x.length) {
    if(x[i] % 2 !== 0) {
    y[i2] = x[i]       // i2-ի արժեքը ավելացնում ենք 1-ով միայն այն դեպքում երբ որ y-ի մեջ արժեք ենք դնում, i2-ը 1-ով ավելացնում ենք որպեսզի հաջորդ արժեքը լինի էտ index-ի մեջ հետո ելի տանում ենք առաջ
    i2 = i2 + 1
    }
   
    i = i + 1
}
alert(y);

i = 0;
i2 = 0;

while(i < x.length) {
    if(x[i] % 2 === 0) {
    y[i2] = x[i]       // i2-ի արժեքը ավելացնում ենք 1-ով միայն այն դեպքում երբ որ y-ի մեջ արժեք ենք դնում, i2-ը 1-ով ավելացնում ենք որպեսզի հաջորդ արժեքը լինի էտ index-ի մեջ հետո ելի տանում ենք առաջ
    i2 = i2 + 1
    }
   
    i = i + 1
}
alert(y);


let a = 55;
let b = 7;
let z = 12, d = a + b;
let o = [a*2];
o[b] = 3;

alert( ( !!!(z === 4+3*2+(5%2)) && !(o[0] === 112) ) || ( a*b<100 && o.length>=8 ) );
